# US - Baby Names

### Introduction:

We are going to use a subset of [US Baby Names](https://www.kaggle.com/kaggle/us-baby-names) from Kaggle.  
In the file it will be names from 2004 until 2014


### Step 1. Import the necessary libraries

In [1]:
#import libraries
import pandas as pd

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv).

### Step 3. Assign it to a variable called baby_names.

In [2]:
#read data
baby_names=pd.read_csv('https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv',sep=',')

### Step 4. See the first 10 entries

In [3]:
#shows first 10 entries
baby_names.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [4]:
#delete the column unnamed: 0 and ID
baby_names.drop(columns=['Unnamed: 0','Id'])

            Name  Year Gender State  Count
0           Emma  2004      F    AK     62
1        Madison  2004      F    AK     48
2         Hannah  2004      F    AK     46
3          Grace  2004      F    AK     44
4          Emily  2004      F    AK     41
...          ...   ...    ...   ...    ...
1016390     Seth  2014      M    WY      5
1016391  Spencer  2014      M    WY      5
1016392     Tyce  2014      M    WY      5
1016393   Victor  2014      M    WY      5
1016394   Waylon  2014      M    WY      5

[1016395 rows x 5 columns]

### Step 6. Is there more male or female names in the dataset?

In [5]:
#shows the sum of males and females
baby_names.groupby('Gender')['Count'].sum()

Gender
F    16380293
M    19041199
Name: Count, dtype: int64

### Step 7. Group the dataset by name and assign to names

In [6]:
#grouping by names
names=baby_names.groupby('Name').sum()

### Step 8. How many different names exist in the dataset?

In [7]:
#shows diffrent names
baby_names.Name.drop_duplicates().count()
#or 
baby_names.Name.nunique()

17632

### Step 9. What is the name with most occurrences?

In [8]:
#the most occurrence name
names.Count.idxmax()
#or
names.loc[names.Count==names.Count.max()]
#or
names.Count.sort_values(ascending=False)

Name
Jacob         242874
Emma          214852
Michael       214405
Ethan         209277
Isabella      204798
               ...
Eniola             5
Atlantis           5
Marci              5
Simarpreet         5
Nita               5
Name: Count, Length: 17632, dtype: int64

### Step 10. How many different names have the least occurrences?

In [9]:
#shows how many diffrent names with least occurrence
len(names.loc[names.Count==names.Count.min()])

2578

### Step 11. What is the median name occurrence?

In [10]:
#shows the names with median occurrence
names.loc[names.Count==names.Count.median()]

         Unnamed: 0        Id   Year  Count
Name
Aishani     7810519   7810526  14078     49
Alara      18841019  18841027  16079     49
Alysse     22629397  22629405  16057     49
Ameir      21780403  21780411  16086     49
Anely       4349533   4349541  16071     49
...             ...       ...    ...    ...
Sriram      9208196   9208203  14054     49
Trinton    32822294  32822302  16069     49
Vita       10241625  10241632  14075     49
Yoni        6439146   6439154  16060     49
Zuleima     3521366   3521373  14050     49

[66 rows x 4 columns]

### Step 12. What is the standard deviation of names?

In [11]:
#shows the STD of names 
names.Count.std()

11006.069467891111

### Step 13. Get a summary with the mean, min, max, std and quartiles.

In [12]:
#describe the name
names.Count.describe()
#or
names.Count.agg(['mean','min','max'])

mean      2008.932169
min          5.000000
max     242874.000000
Name: Count, dtype: float64